validation/particleAssemblies/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  dev                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     simleIBMFoam;

startFrom       startTime;

startTime       0;

stopAt          endTime;

endTime         30;

deltaT          .001;

writeControl    adjustableRunTime;

writeInterval   .01;

purgeWrite      20;

writeFormat     ascii;

writePrecision  10;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable true;

adjustTimeStep  yes;

maxCo           1;

functions0
{
    probes
    {
        libs            ("libsampling.so");
        type            probes;
        name            probes;
        writeControl    timeStep;
        writeInterval   1;
        fields          (p);
        probeLocations
        (
            ( -0.045  0     0     )
            ( -0.045  0.020 0     )
            ( -0.010  0     0     )
            (  0.0125 0     0     )
            (  0.0125 0.020 0     )
        );
    }
}

// ************************************************************************* //
