validation/particleAssemblies/0.org/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  dev                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);
freestreamValue uniform (0.3 0 0);
boundaryField
{
    inlet
    {
        type            cyclic;
        value           $freestreamValue;
    }

    outlet
    {
        type            cyclic;
    }

    defaultFaces
    {
        type            empty;
    }

    freestream1
    {
        type            cyclic;
    }
    freestream2
    {
        type            cyclic;
    }
    freestream3
    {
        type            empty;
    }
    freestream4
    {
        type            empty;
    }
}

// ************************************************************************* //
