validation/particleAssemblies/system/initializeIBMDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  dev                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      innializeIBMDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
particleSizeDistribution monodisperse;

flow
{
    UInf            (0.5 0 0);
    rho             rhoInf;
    rhoInf          1.4;
}

PSD
{
    nParticles      20;
    deltaR          0.05;

}

baseParticle
{
    p1              (-.45 -.45 -0.5);
    p2              (1 .45 0.5);
    d               0.1;
    nTheta          100;
    delta           0.0075;
}

// ************************************************************************* //
